import random
# 导入random模块进行随机数抽取
total_res = []
# 定义一个total_res空列表用于保存已经抽过的人数
while True:
    # 循环执行程序
    print('抽几个人？')
    # 询问要抽取的人数
    num = input('')
    # 读取输入值
    num = int(num)
    # 将输入的字符串转换成整型

    name = ["测试员1", "测试员2", "测试员3", "测试员4", "测试员5", "测试员6", "测试员7", "测试员8", "测试员9", "测试员10",
            "测试员11", "测试员12", "测试员13", "测试员14", "测试员15", "测试员16", "测试员17", "测试员18", "测试员19", "测试员20",
            "测试员21", "测试员22", "测试员23", "测试员24", "测试员25", "测试员26", "测试员27", "测试员28", "测试员29", "测试员30",
            "测试员31", "测试员32", "测试员33", "测试员34", "测试员35", "测试员36", "测试员37", "测试员38", "测试员39", "测试员40",
            "测试员41", "测试员42", "测试员43", "测试员44", "测试员45", "测试员46", "测试员47", "测试员48", "测试员49", "测试员50",
            "测试员51", "测试员52", "测试员53", "测试员54", "测试员55", "测试员56", "测试员57", "测试员58"]

    # 定义一个列表保存所有同学的姓名用于匹配随机抽取到的学号
    res = random.sample(range(1, 59), num)
    # 从1-58随机抽取num个不重复的数
    while True:
        while True:
            print('本次抽到的人'+str(res))
            # 输出本次抽到的学号
            for i in res:
                print(str(i) + '号' + name[i-1])
            #     遍历本次抽到的人并匹配姓名后输出
            if res not in total_res:
                for i in res:
                    total_res.append(i)
                #     将本次抽取到的人追加到total_res列表
                total_res.sort(reverse=False)
                # 对total_res列表进行排序
                print('已经抽过的人'+str(total_res))
                # 输出已经抽到过的人

            othor = []
            # 定义一个other空列表用于保存还没被抽到的人
            for i in range(1,59):
                # 对1-58号进行遍历
                if i not in total_res:
                    # 如果遍历到的数字不在total_res列表中，就是还没被抽到的人
                    othor.append(i)
            #         将还没被抽到的人追加到other列表
            # 注意，这个other列表定义在内循环里面，所以每抽完一次人other列表清空并重新计算还没被抽到的人数
            # 效果就是other列表每次都是以一个空列表去接收比上次更少的值，所以没被抽到的人会越来越少
            print('还没抽过的人'+str(othor))
            # 输出没被抽到的人的学号
            print('抽几个人？')
            num = input('')
            num = int(num)
            # 程序下一次运行
            res = random.sample(othor, num)
    #         从other列表中随机抽取num个不重复的数
    continue

